GREETING = "Привет! 👋 \n\nЯ твой личный помощник по криптокошелькам! \n \n\
Отслеживай балансы токенов в своих кошельках и получай сообщения об обновлениях! 🚀"

INFO_COMPACT = "*Вот что я могу для тебя сделать:* \n\n\
📜 Посмотреть *список кошельков*: /wallets.\n\n\
💼 Добавить *новый кошелёк*: /addwallet. \n\n\
💰 Посмотреть *токены* в кошельках и их количество: /walletmenu. \n\n\
\n\
❌ *Удалить кошелёк*: /deletewallet. \n\n\
🔔 Для получения *информации* о доступных командах отправь мне команду /help. \n\n"


NO_WALLET = "Сейчас нет активных кошельков. \nНапишите /addwallet для добавления нового кошелька. 📥"
WALLET_DOESNT_EXIST = "К сожалению, кошелька с таким адресом не существует ❌ \n\nПожалуйста, убедитесь в правильности введенного адреса и попробуйте еще раз. 💼✨"
WALLET_WRONG = "Что то пошло не так ❌ \n\nПопробуйте еще раз добавить кошелек."
WALLET_LIST = "🔔 Список найденных кошельков:\n"
ADD_WALLET_MESSAGE = 'Напишите /addwallet для добавления нового кошелька. 📥'

BALANCE_LIST = "🔔 Список отслеживаемых токенов:\n"
