GREETING = "Привет! 👋 \n\nЯ твой личный помощник по криптокошелькам! 🌟 \n \n\
Отслеживай балансы токенов в своих кошельках, подписывайся на уведомления и получай сообщения об обновлениях! 🚀✨"

INFO = "*Вот что я могу для тебя сделать:* \n\n\
📜 Посмотреть *список кошельков*: \n\
       просто отправь мне команду /wallets и я предоставлю тебе информацию о добавленных кошельках.\n\n\
💼 Добавить *новый кошелёк*: \n\
       используй команду /addwallet и я сохраню информацию о новом кошельке. \n\n\
💰 Посмотреть *токены* в кошельках и их количество: \n\
       отправь мне команду /tokens и я расскажу тебе, какие покажиу инфомацию об отслеживаемых токенах в кошельках. \n\n\
➕ Добавить *новый токен* в кошелёк: \n\
       используй команду /addtoken и я сохраню конфигурация нового кошелька для отселиживания баланса. \n\n\
📥 *Подписаться* на обновления: \n\
       используй команду /connect и я буду присылать информацию об обновленных балансах токенов. \n\n\
🔌 *Отписаться* от обновлений: \n\
       используй команду /stop и я буду перестану присылать информацию об обновленных балансах токенов. \n\n\
🔔 Для получения *информации* о доступных командах отправь мне команду /help. \n\n\
❌ *Удалить кошелёк*: \deletewallet. \n\n\
❌ *Удалить токен*: \deletewallet. \n\n\
❌ Для *выхода* из режима добавления нового кошелька или токена отправьте команду /cancel."

INFO_COMPACT = "*Вот что я могу для тебя сделать:* \n\n\
📜 Посмотреть *список кошельков*: /wallets.\n\n\
💼 Добавить *новый кошелёк*: /addwallet. \n\n\
💰 Посмотреть *токены* в кошельках и их количество: /tokens. \n\n\
➕ Добавить *новый токен* в кошелёк: /addtoken. \n\n\
➕ Подписаться на обновления: /connect. \n\n\
➕ Отписаться от обновлений: /stop. \n\n\
\n\
❌ *Удалить кошелёк*: /deletewallet. \n\n\
❌ *Удалить токен*: /deletewallet. \n\n\
🔔 Для получения *информации* о доступных командах отправь мне команду /help. \n\n\
❌ Для выхода из режима добавления нового кошелька или токена отправьте команду /cancel."


NO_WALLET = "Сейчас нет активных кошельков. Напишите /addwallet для добавления нового кошелька. 📥"
WALLET_DOESNT_EXIST = "К сожалению, кошелька с таким адресом не существует ❌ \n\nПожалуйста, убедитесь в правильности введенного адреса и попробуйте еще раз. 💼✨"
WALLET_WRONG = "Что то пошло не так ❌ \n\nПопробуйте еще раз добавить кошелек."
WALLET_LIST = "🔔 Список найденных кошельков:\n"
ADD_WALLET_MESSAGE = 'Напишите /addwallet для добавления нового кошелька. 📥'


NO_BALANCE = "Сейчас нет отслеживаемых токенов. Напишите /addtoken для добавления нового токена. 📥"
BALANCE_WRONG = "Что то пошло не так ❌ \n\nПопробуйте еще раз."
BALANCE_LIST = "🔔 Список отслеживаемых токенов:\n"
ADD_BALANCE_MESSAGE = 'Напишите /addtoken для добавления нового токена. 📥'
